app/views/listask/details.html.erb

      <div class="panel-body">
        <% @listd.simpletask.each do |task| %>
---
SELECT "all_tasks".* FROM "all_tasks" WHERE "all_tasks"."listask_id" = ?  [["listask_id", 1]]
SELECT "simpletasks".* FROM "simpletasks" WHERE "simpletasks"."listask_id" = ? ORDER BY prioridad.to_i desc  [["listask_id", 1]]