app/controllers/home_controller.rb

  def home
  @lists = Listask.all
---
SELECT "listasks".* FROM "listasks"