app/controllers/listask_controller.rb

SELECT  "listasks".* FROM "listasks" ORDER BY "listasks"."id" DESC LIMIT ?  [["LIMIT", 5]]
---
    def home
        @lists = Listask.last(5)

INSERT INTO "listasks" ("nombre", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?)  [["nombre", "fdf  fd  dfddf"], ["created_at", 2017-02-01 02:17:24 UTC], ["updated_at", 2017-02-01 02:17:24 UTC], ["slug", "fdf-fd-dfddf"]]
---
	def create
		@list = Listask.new()
		@list.nombre = params[:listask]['nombre']
		if @list.save

SELECT "listasks".* FROM "listasks" WHERE (slug = 'fdf-fd-dfddf' )
UPDATE "listasks" SET "nombre" = ?, "updated_at" = ? WHERE "listasks"."id" = ?  [["nombre", "#<ActionController::Parameters:0xb574ec0c>"], ["updated_at", 2017-02-07 18:57:02 UTC], ["id", 1]]
---
	def update
		 @listd = Listask.where("slug = ? ", params['slug'])[0]
         @listd.nombre = params['listask']["nombre"]
         @listd.save

SELECT  "listasks".* FROM "listasks" WHERE "listasks"."slug" = ? LIMIT ?  [["slug", "fdf-fd-dfddf"], ["LIMIT", 1]]
SELECT "all_tasks".* FROM "all_tasks" WHERE "all_tasks"."listask_id" = ?  [["listask_id", 1]]
SELECT "simpletasks".* FROM "simpletasks" WHERE "simpletasks"."listask_id" = ? ORDER BY prioridad.to_i desc  [["listask_id", 1]]
---
	def details
       @listd = Listask.where("slug = ? ", params['slug'])[0]
       @listd.simpletask.where("tasktype = ? ", "TempTask").each do |temp|