app/controllers/simpletask_controller.rb

SELECT "listasks".* FROM "listasks" WHERE (slug = 'fdf-fd-dfddf' )
INSERT INTO "simpletasks" ("descripcion", "estado", "prioridad", "listask_id", "created_at", "updated_at", "tasktype") VALUES (?, ?, ?, ?, ?, ?, ?)  [["descripcion", "prueba"], ["estado", "2"], ["prioridad", "2"], ["listask_id", 1], ["created_at", 2017-02-07 22:21:44 UTC], ["updated_at", 2017-02-07 22:21:44 UTC], ["tasktype", "SimpleTask"]]
---
  def createsimple
     @list = Listask.where("slug = ? ", params['task'])[0]
     @dd = Simpletask.new()
     @dd.tasktype = "SimpleTask"
     @dd.descripcion = params[:simpletask][:descripcion]
     @dd.prioridad = params[:simpletask][:prioridad]
     @dd.estado = params[:simpletask][:estado]
     @dd.listask_id = @list.id
     @dd.save()

SELECT "listasks".* FROM "listasks" WHERE (slug = 'fdf-fd-dfddf' )
---
def createlong
     @list = Listask.where("slug = ? ", params['task'])[0]

SELECT "listasks".* FROM "listasks" WHERE (slug = 'fdf-fd-dfddf' )
---
def createmp
     puts params
     @list = Listask.where("slug = ? ", params['task'])[0]

SELECT "listasks".* FROM "listasks" WHERE (id = 1 )
---
def updatetemp
     @dd = Temporaltask.where("id = ? ", params['task'])[0]
     @dd.descripcion = params[:temporaltask][:descripcion]
     @dd.prioridad = params[:temporaltask][:prioridad]
     @dd.estado = params[:temporaltask][:estado]
     @dd.fecha_inicio =  Date.new(params[:start_date]["year"].to_i,params['start_date']["month"].to_i,params['start_date']["day"].to_i)
     @dd.fecha_fin =  Date.new(params[:end_date]["year"].to_i,params['end_date']["month"].to_i,params['end_date']["day"].to_i)
     @dd.save()
     flash[:error] = @dd.errors
     redirect_to controller: "listask", action: "details", slug: Listask.where("id = ? ", @dd.listask_id)[0].slug

SELECT "listasks".* FROM "listasks" WHERE (id = 1 )
---
def updatelong
     @dd = Longtask.where("id = ? ", params['task'])[0]
     @dd.descripcion = params[:longtask][:descripcion]
     @dd.prioridad = params[:longtask][:prioridad]
     @dd.porcentaje = params[:longtask][:progreso]
     @dd.estado = params[:longtask][:estado]
     @dd.save()
     flash[:error] = @dd.errors
     redirect_to controller: "listask", action: "details", slug: Listask.where("id = ? ", @dd.listask_id)[0].slug

SELECT "simpletasks".* FROM "simpletasks" WHERE (id = '1' )
UPDATE "simpletasks" SET "prioridad" = ?, "updated_at" = ? WHERE "simpletasks"."id" = ?  [["prioridad", "2"], ["updated_at", 2017-02-07 17:29:21 UTC], ["id", 1]]
SELECT "listasks".* FROM "listasks" WHERE (id = 1 )
---
def updatesimple
     @dd = Simpletask.where("id = ? ", params['task'])[0]
     @dd.descripcion = params[:simpletask][:descripcion]
     @dd.prioridad = params[:simpletask][:prioridad]
     @dd.estado = params[:simpletask][:estado]
     @dd.save()
     flash[:error] = @dd.errors
     redirect_to controller: "listask", action: "details", slug: Listask.where("id = ? ", @dd.listask_id)[0].slug